dhsu-nordic/sdk-nrf/drivers/wifi/nrf71/src/common/util_shell.c
	fmac_dev_ctx = ctx->rpu_ctx;

	status = nrf_wifi_sys_fmac_rpu_recovery_callback(fmac_dev_ctx, NULL, 0);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Failed to trigger RPU recovery\n");
		return -ENOEXEC;
	}

	shell_fprintf(sh,
		      SHELL_INFO,
		      "RPU recovery triggered\n");

	ret = 0;
unlock:
	k_mutex_unlock(&ctx->rpu_lock);
	return ret;
}

static int nrf_wifi_util_rpu_recovery_info(const struct shell *sh,
					   size_t argc,
					   const char *argv[])
{
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_hal_dev_ctx *hal_dev_ctx = NULL;
	unsigned long current_time_ms = k_uptime_get();
	int ret;

	k_mutex_lock(&ctx->rpu_lock, K_FOREVER);
	if (!ctx || !ctx->rpu_ctx) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "RPU context not initialized\n");
		ret = -ENOEXEC;
		goto unlock;
	}

	fmac_dev_ctx = ctx->rpu_ctx;
	if (!fmac_dev_ctx) {
		shell_fprintf(sh, SHELL_ERROR, "FMAC context not initialized\n");
		ret = -ENOEXEC;
		goto unlock;
	}

	hal_dev_ctx = fmac_dev_ctx->hal_dev_ctx;
	if (!hal_dev_ctx) {
		shell_fprintf(sh, SHELL_ERROR, "HAL context not initialized\n");
		ret = -ENOEXEC;
		goto unlock;
	}

	shell_fprintf(sh, SHELL_INFO,
		      "wdt_irq_received: %d\n"
		      "wdt_irq_ignored: %d\n"
		      "last_wakeup_now_asserted_time_ms: %lu milliseconds\n"
		      "last_wakeup_now_deasserted_time_ms: %lu milliseconds\n"
		      "last_rpu_sleep_opp_time_ms: %lu milliseconds\n"
		      "current time: %lu milliseconds\n"
		      "rpu_recovery_success: %d\n"
		      "rpu_recovery_failure: %d\n\n",
		      ctx->wdt_irq_received, ctx->wdt_irq_ignored,
		      hal_dev_ctx->last_wakeup_now_asserted_time_ms,
		      hal_dev_ctx->last_wakeup_now_deasserted_time_ms,
		      hal_dev_ctx->last_rpu_sleep_opp_time_ms, current_time_ms,
		      ctx->rpu_recovery_success, ctx->rpu_recovery_failure);

	ret = 0;
unlock:
	k_mutex_unlock(&ctx->rpu_lock);
	return ret;
}
#endif /* !CONFIG_NRF71_RADIO_TEST && !CONFIG_NRF71_OFFLOADED_RAW_TX */

#if !defined(CONFIG_NRF71_RADIO_TEST) && !defined(CONFIG_NRF71_OFFLOADED_RAW_TX)
static int nrf_wifi_util_clear_rpu_stats(const struct shell *sh,
					 size_t argc,
					 const char *argv[])
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	enum rpu_stats_type stats_type = RPU_STATS_TYPE_ALL;
	int ret = 0;

	if (argc == 2) {
		const char *type = argv[1];

		if (!strcmp(type, "umac")) {
			stats_type = RPU_STATS_TYPE_UMAC;
		} else if (!strcmp(type, "lmac")) {
			stats_type = RPU_STATS_TYPE_LMAC;
		} else if (!strcmp(type, "phy")) {
			stats_type = RPU_STATS_TYPE_PHY;
		} else if (!strcmp(type, "all")) {
			stats_type = RPU_STATS_TYPE_ALL;
		} else {
			shell_fprintf(sh, SHELL_ERROR, "Invalid stats type %s\n", type);
			return -ENOEXEC;
		}
	}

	k_mutex_lock(&ctx->rpu_lock, K_FOREVER);
	if (!ctx->rpu_ctx) {
		shell_fprintf(sh, SHELL_ERROR, "RPU context not initialized\n");
		ret = -ENOEXEC;
		goto unlock_clear;
	}
	fmac_dev_ctx = ctx->rpu_ctx;

	status = umac_cmd_sys_clear_stats(fmac_dev_ctx, stats_type);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		shell_fprintf(sh, SHELL_ERROR, "Failed to clear RPU stats\n");
		ret = -ENOEXEC;
	} else {
		shell_fprintf(sh, SHELL_INFO, "RPU stats cleared\n");
	}
unlock_clear:
	k_mutex_unlock(&ctx->rpu_lock);
	return ret;
}

static void dump_umac_rx_dbg_params(const struct shell *sh,
				    const struct umac_rx_dbg_params *rx)
{
	shell_fprintf(sh, SHELL_INFO, "  lmac_events=%u rx_events=%u rx_coalesce_events=%u\n",
		      rx->lmac_events, rx->rx_events, rx->rx_coalesce_events);
	shell_fprintf(sh, SHELL_INFO, "  total_rx_pkts_from_lmac=%u max_refill_gap=%u\n",
		      rx->total_rx_pkts_from_lmac, rx->max_refill_gap);
	shell_fprintf(sh, SHELL_INFO, "  current_refill_gap=%u out_of_order_mpdus=%u\n",
		      rx->current_refill_gap, rx->out_of_order_mpdus);
	shell_fprintf(sh, SHELL_INFO, "  reorder_free_mpdus=%u umac_consumed_pkts=%u\n",
		      rx->reorder_free_mpdus, rx->umac_consumed_pkts);
	shell_fprintf(sh, SHELL_INFO, "  host_consumed_pkts=%u reordering_ampdu=%u\n",
		      rx->host_consumed_pkts, rx->reordering_ampdu);
	shell_fprintf(sh, SHELL_INFO, "  userspace_offload_frames=%u rx_packet_total_count=%u\n",
		      rx->userspace_offload_frames, rx->rx_packet_total_count);
	shell_fprintf(sh, SHELL_INFO, "  rx_packet_data_count=%u rx_packet_qos_data_count=%u\n",
		      rx->rx_packet_data_count, rx->rx_packet_qos_data_count);
	shell_fprintf(sh, SHELL_INFO,
		      "  rx_packet_protected_data_count=%u rx_packet_mgmt_count=%u\n",
		      rx->rx_packet_protected_data_count, rx->rx_packet_mgmt_count);
	shell_fprintf(sh, SHELL_INFO,
		      "  rx_packet_beacon_count=%u rx_packet_probe_resp_count=%u\n",
		      rx->rx_packet_beacon_count, rx->rx_packet_probe_resp_count);
	shell_fprintf(sh, SHELL_INFO,
		      "  rx_packet_auth_count=%u rx_packet_deauth_count=%u\n",
		      rx->rx_packet_auth_count, rx->rx_packet_deauth_count);
	shell_fprintf(sh, SHELL_INFO,
		      "  rx_packet_assoc_resp_count=%u rx_packet_disassoc_count=%u\n",
		      rx->rx_packet_assoc_resp_count, rx->rx_packet_disassoc_count);
	shell_fprintf(sh, SHELL_INFO,
		      "  rx_packet_action_count=%u rx_packet_probe_req_count=%u\n",
		      rx->rx_packet_action_count, rx->rx_packet_probe_req_count);
	shell_fprintf(sh, SHELL_INFO,
		      "  rx_packet_other_mgmt_count=%u max_coalesce_pkts=%u\n",
		      rx->rx_packet_other_mgmt_count, rx->max_coalesce_pkts);
	shell_fprintf(sh, SHELL_INFO,
		      "  null_skb_pointer_from_lmac=%u null_skb_pointer_from_host=%u\n",
		      rx->null_skb_pointer_from_lmac, rx->null_skb_pointer_from_host);
	shell_fprintf(sh, SHELL_INFO,
		      "  null_skb_pointer_resubmitted=%u unexpected_mgmt_pkt=%u\n",
		      rx->null_skb_pointer_resubmitted, rx->unexpected_mgmt_pkt);
	shell_fprintf(sh, SHELL_INFO,
		      "  reorder_flush_pkt_count=%u unsecured_data_error=%u\n",
		      rx->reorder_flush_pkt_count, rx->unsecured_data_error);
	shell_fprintf(sh, SHELL_INFO,
		      "  pkts_in_null_skb_pointer_event=%u rx_buffs_resubmit_cnt=%u\n",
		      rx->pkts_in_null_skb_pointer_event, rx->rx_buffs_resubmit_cnt);
	shell_fprintf(sh, SHELL_INFO, "  rx_packet_amsdu_cnt=%u rx_packet_mpdu_cnt=%u\n",
		      rx->rx_packet_amsdu_cnt, rx->rx_packet_mpdu_cnt);
	shell_fprintf(sh, SHELL_INFO,
		      "  rx_err_secondary_pkt=%u rx_err_invalid_pkt_info_type=%u\n",
		      rx->rx_err_secondary_pkt, rx->rx_err_invalid_pkt_info_type);
}

