dhsu-nordic/sdk-nrf/drivers/wifi/nrf71/src/common/util_shell.c
static int nrf_wifi_util_heap(const struct shell *sh, size_t argc, char **argv)
{
	struct k_heap *ctrl_pool;
	struct k_heap *data_pool;
	struct sys_memory_stats stats;
	int err;

	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	nrf_wifi_mem_get_heaps(&ctrl_pool, &data_pool);

	err = sys_heap_runtime_stats_get(&ctrl_pool->heap, &stats);
	if (err) {
		shell_error(sh, "Failed to read control heap statistics (err %d)", err);
		return -ENOEXEC;
	}
	shell_print(sh, "Control pool:");
	shell_print(sh, "  free:           %zu", stats.free_bytes);
	shell_print(sh, "  allocated:      %zu", stats.allocated_bytes);
	shell_print(sh, "  max. allocated: %zu", stats.max_allocated_bytes);

	err = sys_heap_runtime_stats_get(&data_pool->heap, &stats);
	if (err) {
		shell_error(sh, "Failed to read data heap statistics (err %d)", err);
		return -ENOEXEC;
	}
	shell_print(sh, "Data pool:");
	shell_print(sh, "  free:           %zu", stats.free_bytes);
	shell_print(sh, "  allocated:      %zu", stats.allocated_bytes);
	shell_print(sh, "  max. allocated: %zu", stats.max_allocated_bytes);

	return 0;
}

static void nrf_wifi_util_dump_mac_addr_slots(const struct shell *sh, bool uicr)
{
	const char *block = uicr ? "UICR" : "FICR";

	for (unsigned char slot = 0; slot < NRF_WIFI_XICR_MAC_ADDR_SLOTS; slot++) {
		uint32_t low, high;
		int ret;

		ret = nrf_wifi_xicr_mac_addr_slot_read(uicr, slot, &low, &high);
		if (ret == -ENOTSUP) {
			shell_print(sh, "%s: not accessible", block);
			return;
		} else if (ret) {
			shell_error(sh, "%s MACADDR[%u]: read failed (err %d)",
				    block, slot, ret);
			continue;
		}

		shell_print(sh, "%s MACADDR[%u].LOW  = 0x%08X", block, slot, low);
		shell_print(sh, "%s MACADDR[%u].HIGH = 0x%08X", block, slot, high);

		if (nrf_wifi_mac_addr_regs_empty(low, high)) {
			shell_print(sh, "%s MACADDR[%u]      = not programmed",
				    block, slot);
			continue;
		}

		/* HIGH holds bits [47:24] of the address, LOW bits [23:0], both
		 * MSB first, so 00F4CE36 / 00112233 is F4:CE:36:11:22:33.
		 */
		shell_print(sh, "%s MACADDR[%u]      = %02X:%02X:%02X:%02X:%02X:%02X",
			    block, slot,
			    (uint8_t)(high >> 16), (uint8_t)(high >> 8), (uint8_t)high,
			    (uint8_t)(low >> 16), (uint8_t)(low >> 8), (uint8_t)low);
	}
}

static int nrf_wifi_util_mac_addr(const struct shell *sh, size_t argc, char **argv)
{
	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	nrf_wifi_util_dump_mac_addr_slots(sh, true);
	nrf_wifi_util_dump_mac_addr_slots(sh, false);

	for (unsigned char vif_idx = 0; vif_idx < MAX_NUM_VIFS; vif_idx++) {
		uint8_t mac_addr[WIFI_MAC_ADDR_LEN];
		int ret;

		ret = nrf_wifi_xicr_mac_addr_get(vif_idx, mac_addr, NULL);
		if (ret) {
			shell_error(sh, "VIF%u: no MAC address available (err %d)",
				    vif_idx, ret);
			continue;
		}

		shell_print(sh, "VIF%u resolved    = %02X:%02X:%02X:%02X:%02X:%02X",
			    vif_idx,
			    mac_addr[0], mac_addr[1], mac_addr[2],
			    mac_addr[3], mac_addr[4], mac_addr[5]);
	}

	return 0;
}

static void ftm_parse_uint(const char *segment, const char *key, unsigned long *value)
{
	const char *token = strstr(segment, key);

	if (token) {
		sscanf(token + strlen(key), "%lu", value);
	}
}

static int nrf_wifi_util_ftm_start(const struct shell *sh, size_t argc, char **argv)
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_umac_cmd_meas_start ftm_cmd;
	char conf_buf[256] = {0};
	char *segment = NULL;
	char *token = NULL;
	unsigned long value = 0;
	size_t offset = 0;
	unsigned int peer_index = 0;
	int ret = 0;

	memset(&ftm_cmd, 0, sizeof(ftm_cmd));

	for (unsigned int i = 1; i < argc; i++) {
		int length = snprintf(conf_buf + offset,
				      sizeof(conf_buf) - offset,
				      "%s%s",
				      offset ? " " : "",
				      argv[i]);

		if ((length < 0) || ((size_t)length >= sizeof(conf_buf) - offset)) {
			shell_error(sh, "FTM parameters too long");
			return -ENOEXEC;
		}

		offset += length;
	}

	token = strstr(conf_buf, "num_of_peers=");
	if (!token) {
		shell_error(sh, "num_of_peers is mandatory");
		shell_help(sh);
		return -ENOEXEC;
	}

	sscanf(token + strlen("num_of_peers="), "%lu", &value);
	ftm_cmd.info.n_peers = value;
	if ((ftm_cmd.info.n_peers == 0) ||
	    (ftm_cmd.info.n_peers > MAX_NUM_PEERS)) {
		shell_error(sh, "Invalid num_of_peers %u (valid: 1 - %d)",
			    ftm_cmd.info.n_peers, MAX_NUM_PEERS);
		return -ENOEXEC;
	}

	segment = conf_buf;
	for (peer_index = 0; peer_index < ftm_cmd.info.n_peers; peer_index++) {
		struct nrf_wifi_umac_meas_request *request =
			&ftm_cmd.info.meas_req[peer_index];
		unsigned int mac[NRF_WIFI_ETH_ADDR_LEN];
		char *next_segment = NULL;
		char saved = '\0';

		token = strstr(segment, "mac_addr=");
		if (!token) {
			shell_error(sh, "mac_addr missing for peer %u", peer_index);
			return -ENOEXEC;
		}

		if (sscanf(token + strlen("mac_addr="),
			   "%x:%x:%x:%x:%x:%x",
			   &mac[0], &mac[1], &mac[2], &mac[3], &mac[4], &mac[5]) !=
		    NRF_WIFI_ETH_ADDR_LEN) {
			shell_error(sh,
				    "Invalid mac_addr for peer %u (expected xx:xx:xx:xx:xx:xx)",
				    peer_index);
			return -ENOEXEC;
		}

		for (unsigned int byte = 0; byte < NRF_WIFI_ETH_ADDR_LEN; byte++) {
			request->mac_addr[byte] = (unsigned char)mac[byte];
		}

		next_segment = strstr(token + strlen("mac_addr="), "mac_addr=");
		if (next_segment) {
			saved = *next_segment;
			*next_segment = '\0';
		}

		value = 0;
		ftm_parse_uint(token, "band=", &value);
		request->band = (signed int)value;
		value = 0;
		ftm_parse_uint(token, "center_freq=", &value);
		request->center_frequency = (unsigned int)value;
		value = 0;
		ftm_parse_uint(token, "preamble=", &value);
		request->preamble = (signed int)value;
		value = 0;
		ftm_parse_uint(token, "burst_period=", &value);
		request->burst_period = (unsigned char)value;
		value = 0;
		ftm_parse_uint(token, "ftms_per_burst=", &value);
		request->ftms_per_burst = (unsigned char)value;
		value = 0;
		ftm_parse_uint(token, "ftm_params=", &value);
		request->ftm_params = (unsigned char)value;
		value = 0;
		ftm_parse_uint(token, "burst_duration=", &value);
		request->burst_duration = (unsigned char)value;
		value = 0;
		ftm_parse_uint(token, "num_bursts_exp=", &value);
		request->num_bursts_exp = (unsigned char)value;
		value = 0;
		ftm_parse_uint(token, "min_delta_ftm=", &value);
		request->min_delta_ftm = (unsigned char)value;
		value = 0;
		ftm_parse_uint(token, "tsf_timer_value=", &value);
		request->tsf_timer_value = (unsigned short)value;
		value = 0;
		ftm_parse_uint(token, "tsf_timer_disable=", &value);
		request->tsf_timer_disable = (unsigned char)value;

		if (next_segment) {
			*next_segment = saved;
			segment = next_segment;
		}
	}

	ftm_cmd.umac_hdr.cmd_evnt = NRF_WIFI_UMAC_CMD_MEAS_START;
	ftm_cmd.umac_hdr.ids.wdev_id = 0;
	ftm_cmd.umac_hdr.ids.valid_fields |= NRF_WIFI_INDEX_IDS_WDEV_ID_VALID;

	k_mutex_lock(&ctx->rpu_lock, K_FOREVER);
	if (!ctx->rpu_ctx) {
		shell_error(sh, "RPU context not initialized");
		ret = -ENOEXEC;
		goto unlock;
	}

