dhsu-nordic/sdk-nrf/drivers/wifi/nrf71/src/common/util_shell.c
	fmac_dev_ctx = ctx->rpu_ctx;
	status = umac_cmd_cfg(fmac_dev_ctx, &ftm_cmd, sizeof(ftm_cmd));
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		shell_error(sh, "Failed to start FTM measurement");
		ret = -ENOEXEC;
		goto unlock;
	}

	shell_print(sh, "FTM measurement started for %u peer(s)",
		    ftm_cmd.info.n_peers);

unlock:
	k_mutex_unlock(&ctx->rpu_lock);
	return ret;
}

SHELL_STATIC_SUBCMD_SET_CREATE(
	nrf71_util,
	SHELL_CMD_ARG(he_ltf,
		      NULL,
		      "0 - 1x HE LTF\n"
		      "1 - 2x HE LTF\n"
		      "2 - 4x HE LTF                                        ",
		      nrf_wifi_util_set_he_ltf,
		      2,
		      0),
	SHELL_CMD_ARG(he_gi,
		      NULL,
		      "0 - 0.8 us\n"
		      "1 - 1.6 us\n"
		      "2 - 3.2 us                                           ",
		      nrf_wifi_util_set_he_gi,
		      2,
		      0),
	SHELL_CMD_ARG(set_he_ltf_gi,
		      NULL,
		      "0 - Disable\n"
		      "1 - Enable",
		      nrf_wifi_util_set_he_ltf_gi,
		      2,
		      0),
#ifdef CONFIG_NRF71_STA_MODE
	SHELL_CMD_ARG(uapsd_queue,
		      NULL,
		      "<val> - 0 to 15",
		      nrf_wifi_util_set_uapsd_queue,
		      2,
		      0),
#endif /* CONFIG_NRF71_STA_MODE */
	SHELL_CMD_ARG(show_config,
		      NULL,
		      "Display the current configuration values",
		      nrf_wifi_util_show_cfg,
		      1,
		      0),
#ifdef CONFIG_NRF71_STA_MODE
	SHELL_CMD_ARG(tx_stats,
		      NULL,
		      "Displays transmit statistics\n"
			  "vif_index: 0 - 1\n",
		      nrf_wifi_util_tx_stats,
		      2,
		      0),
#endif /* CONFIG_NRF71_STA_MODE */
	SHELL_CMD_ARG(tx_rate,
		      NULL,
		      "Sets TX data rate to either a fixed value or AUTO\n"
		      "Parameters:\n"
		      "    <rate_flag> : The TX data rate type to be set, where:\n"
		      "        0 - LEGACY\n"
		      "        1 - HT\n"
		      "        2 - VHT\n"
		      "        3 - HE_SU\n"
		      "        4 - HE_ER_SU\n"
		      "        5 - AUTO\n"
		      "    <rate_val> : The TX data rate value to be set, valid values are:\n"
		      "        Legacy : <1, 2, 55, 11, 6, 9, 12, 18, 24, 36, 48, 54>\n"
		      "        Non-legacy: <MCS index value between 0 - 7>\n"
		      "        AUTO: <No value needed>\n",
		      nrf_wifi_util_tx_rate,
		      2,
		      1),
	SHELL_CMD_ARG(show_vers,
		      NULL,
		      "Display the driver and the firmware versions",
		      nrf_wifi_util_show_vers,
		      1,
		      0),
	SHELL_CMD_ARG(heap,
		      NULL,
		      "Control and data pool heap usage statistics",
		      nrf_wifi_util_heap,
		      1,
		      0),
	SHELL_CMD_ARG(ftm_start,
		      NULL,
		      "Start an FTM ranging session using key=value parameters",
		      nrf_wifi_util_ftm_start,
		      2,
		      20),
#if !defined(CONFIG_NRF71_RADIO_TEST) && !defined(CONFIG_NRF71_OFFLOADED_RAW_TX)
	SHELL_CMD_ARG(rpu_stats,
		      NULL,
		      "Display RPU stats "
		      "Parameters: umac or lmac or phy or all (default)",
		      nrf_wifi_util_dump_rpu_stats,
		      1,
		      1),
	SHELL_CMD_ARG(clear_rpu_stats,
		      NULL,
		      "Clear RPU stats. Parameters: umac|lmac|phy|all (default)",
		      nrf_wifi_util_clear_rpu_stats,
		      1,
		      1),
	SHELL_CMD_ARG(debug_stats,
		      NULL,
		      "Request debug stats from RPU. Parameters: umac|lmac|phy",
		      nrf_wifi_util_debug_stats,
		      1,
		      1),
	SHELL_CMD_ARG(umac_int_stats,
		      NULL,
		      "Request UMAC internal (memory pool) stats from RPU",
		      nrf_wifi_util_umac_int_stats,
		      1,
		      0),
#endif /* !CONFIG_NRF71_RADIO_TEST && !CONFIG_NRF71_OFFLOADED_RAW_TX*/
#ifdef CONFIG_NRF_WIFI_RPU_RECOVERY
	SHELL_CMD_ARG(rpu_recovery_test,
		      NULL,
		      "Trigger RPU recovery",
		      nrf_wifi_util_trigger_rpu_recovery,
		      1,
		      0),
	SHELL_CMD_ARG(rpu_recovery_info,
		      NULL,
		      "Dump RPU recovery information",
		      nrf_wifi_util_rpu_recovery_info,
		      1,
		      0),
#endif /* CONFIG_NRF_WIFI_RPU_RECOVERY */
	SHELL_CMD_ARG(mac_addr,
		      NULL,
		      "Dump the MAC addresses programmed in the xICR registers\n"
		      "and the address each interface resolves to",
		      nrf_wifi_util_mac_addr,
		      1,
		      0),
	SHELL_SUBCMD_SET_END);


SHELL_SUBCMD_ADD((nrf71), util, &nrf71_util, "nRF70 utility commands\n", NULL, 0, 0);


static int nrf_wifi_util_init(void)
{

	if (nrf_wifi_util_conf_init(&ctx->conf_params) < 0) {
		return -1;
	}

	return 0;
}


SYS_INIT(nrf_wifi_util_init,
	 APPLICATION,
	 CONFIG_APPLICATION_INIT_PRIORITY);
